---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.MassDataSurfaceDataSource
source: html/c58ecd5f-b113-8bdc-44d6-369767677992.htm
---
# Autodesk.Revit.DB.ParameterTypeId.MassDataSurfaceDataSource Property

"Values"

## Syntax (C#)
```csharp
public static ForgeTypeId MassDataSurfaceDataSource { get; }
```